#!/usr/bin/python
# -*- coding: utf-8 -*-
import json
import locale
import os

s = {
    "s01": "桑扈·桌",
    "s02": "须臾·茶桌",
    "s03": "流霞明几南宫椅(38CM"
}
# 收藏级
# 优等级
# 实用级
# 一等级
# 具

a = {
    "a001": "参文椅",
    "a002": "参文茶几",
    "a003": "古典卷书搭脑茶几",  # 有金属
    "a004": "江檐椅",  # 有金属
    "a005": "桑扈·椅",
    "a006": "古典卷书搭脑边几",
    "a007": "雀悦长沙发椅",
    "a008": "雀悦短沙发椅",
    "a009": "雀悦平几",  # 有金属
    "a010": "桑扈·案",
    "a011": "雀悦茶几",  # 有金属
    "a012": "雀悦角几",  # 有金属
    "a013": "若水长沙发椅",
    "a014": "江缘短沙发椅",
    "a015": "若水短沙发椅",
    "a016": "若水平几",  # 有金属
    "a017": "若水茶几",  # 有金属
    "a018": "若水角几",
    "a019": "江缘长沙发椅",
    "a020": "明式餐椅",
    "a021": "简明式餐椅",
    "a022": "清式餐椅",
    "a023": "言炎边柜",  # 有金属
    "a024": "明式圆台（1.76米",
    "a025": "明式圆角画案",  # 有金属
    "a026": "明式书架",  # 有金属
    "a027": "桑扈柜",  # 材质球命名 #有金属
    "a028": "明式茶桌1.55米",
    "a029": "虚舟茶桌",
    "a030": "虚舟茶凳",
    "a031": "知闲茶桌",
    "a032": "素官帽椅（42CM",
    # "a033": "传统流霞南宫椅(38CM",  # 法线有问题
    "a034": "流霞明几南宫椅(48CM",
    "a035": "禅椅(大",
    "a036": "禅椅(小",
    "a037": "明式圆台1.48米",
    "a038": "明式圆台1.38米",
}
# 具
# 收藏级
# 优等级
# 实用级
# 一等级
b = {
    "b001": "古典卷书搭脑长沙发椅",
    "b002": "古典卷书搭脑短沙发椅",
    "b003": "古典卷书搭脑平几",  # 有金属
    # "b004": "古典卷书搭脑茶几",
    # "b005": "古典卷书搭脑角几",
    "b006": "江缘平几",
    "b007": "江檐茶几",
    "b008": "明式餐桌1.55米",
    "b009": "清式餐桌1.55米",
    "b010": "无尘书柜",  # 有金属
    "b011": "无尘画案（2.18米二抽",  # 有金属
    "b012": "无尘画案（2.38米二抽",  # 有金属
    "b013": "无尘画案（1.78米四抽",  # 有金属
    "b014": "无尘画案（1.98米四抽",  # 有金属
    "b015": "逸兴办公桌（2.18米二抽",  # 有金属
    "b016": "逸兴办公桌（2.38米二抽",  # 有金属
    "b017": "逸兴办公桌（1.78米四抽",  # 有金属
    "b018": "逸兴办公桌（1.98米四抽",  # 有金属
    "b019": "秦韵大办台(3.4米",
    "b020": "秦韵大办台(3.2米",
    "b021": "圈椅茶桌",
    "b022": "疏香茶桌",
    "b023": "疏香长茶凳",
    "b024": "疏香短茶凳",
    "b025": "言炎茶台（3米",
    "b026": "言炎茶台（3.2米",
    "b027": "言炎茶台（5.2米",
    "b028": "圈椅茶几",
    "b029": "圈椅(38CM",
    "b030": "圈椅(48CM",
    "b031": "明式茶几",
    "b032": "素官帽椅（48CM",
    "b033": "四出头官帽椅茶几",
    "b034": "四出头官帽椅",
    "b035": "博古架式茶边柜（右）",
    "b036": "明式三叶博古架1.86米（左）",  # 有金属
    "b037": "明式三叶博古架2米（左）",  # 有金属
    "b038": "明式双抽双门博古架",  # 有金属
    "b039": "明式翘头三联柜",  # 有金属
    "b040": "五抹圆角柜",  # 有金属
    "b041": "无尘（2.6米电视柜）",
    "b042": "无尘（2.2米电视柜）",
    "b043": "听园·柜",  # 有金属
    "b044": "无为·茶柜",  # 有金属
    "b045": "瑾瑜·条案",
    "b046": "纤月·条案",
    # "b047": "桑扈·案",
    "b048": "九格柜",  # 有金属
    "b049": "听园备餐柜",  # 有金属
    "b050": "五斗柜",  # 有金属
    "b051": "明式三叶博古架1.86米(右)",  # 有金属
    "b052": "明式三叶博古架2米（右）",  # 有金属
    "b053": "博古架式茶边柜（左）",
    "b054": "简衣架"
}
# 收藏级
# 优等级
# 实用级
# 一等级
c = {
    # "c001": "江缘炕几",

    "c002": "明式四仙桌",  # 88 78
    "c003": "明式茶水架",
    "c004": "清式茶边架",
    "c005": "明式茶边架",
}

a.update(s)
a.update(b)
a.update(c)

name = a


t = {
    "椅凳": {
        "a035": "禅椅(大",
        "a036": "禅椅(小",
        "a004": "江檐椅",  # 有金属
        "a001": "参文椅",
        "a002": "参文茶几",

        "a032": "素官帽椅（42CM",
        "b032": "素官帽椅（48CM",
        "b034": "四出头官帽椅",
        "b033": "四出头官帽椅茶几",

        "s03": "流霞明几南宫椅(38CM",
        "a034": "流霞明几南宫椅(48CM"

    },
    "茶室": {
        "c002": "明式四仙桌",  # 88 78
        "c003": "明式茶水架",
        "c004": "清式茶边架",
        "c005": "明式茶边架",
        "b022": "疏香茶桌",
        "b023": "疏香长茶凳",
        "b024": "疏香短茶凳",
        "a029": "虚舟茶桌",
        "a030": "虚舟茶凳",
        "b021": "圈椅茶桌",
        "s02": "须臾·茶桌",
        "b031": "明式茶几",
        "a028": "明式茶桌1.55米",
        "b025": "言炎茶台（3米",
        "b026": "言炎茶台（3.2米",
        "b027": "言炎茶台（5.2米",
        "b029": "圈椅(38CM",
        "a031": "知闲茶桌",

        "b030": "圈椅(48CM",
        "b028": "圈椅茶几",

    },
    "客厅": {
        "b006": "江缘平几",
        "b007": "江檐茶几",
        "a013": "若水长沙发椅",
        "a014": "江缘短沙发椅",
        "a015": "若水短沙发椅",
        "a019": "江缘长沙发椅",
        "a016": "若水平几",  # 有金属
        "a017": "若水茶几",  # 有金属
        "a018": "若水角几",
        "a011": "雀悦茶几",  # 有金属
        "a012": "雀悦角几",
        "a007": "雀悦长沙发椅",
        "a008": "雀悦短沙发椅",
        "a009": "雀悦平几",  #
        "b001": "古典卷书搭脑长沙发椅",
        "b002": "古典卷书搭脑短沙发椅",
        "b003": "古典卷书搭脑平几",  # 有金属
        "a003": "古典卷书搭脑茶几",  # 有金属
        "a006": "古典卷书搭脑边几",
        "b041": "无尘（2.6米电视柜）",
        "b042": "无尘（2.2米电视柜）",

    },
    "柜架": {
        "b051": "明式三叶博古架1.86米(右)",  # 有金属
        "b052": "明式三叶博古架2米（右）",  # 有金属
        "b053": "博古架式茶边柜（左）",
        "b035": "博古架式茶边柜（右）",
        "b036": "明式三叶博古架1.86米（左）",  # 有金属
        "b037": "明式三叶博古架2米（左）",
        "b038": "明式双抽双门博古架",  # 有金属
        "b048": "九格柜",  # 有金属
        "b049": "听园备餐柜",  # 有金属
        "b050": "五斗柜",  # 有金属
        "b039": "明式翘头三联柜",  # 有金属
        "b040": "五抹圆角柜",  # 有金属
        "b043": "听园·柜",  # 有金属
        "b044": "无为·茶柜",  # 有金属
        "a023": "言炎边柜",  # 有金属

    },
    "条案": {
        "B045": "瑾瑜·条案",
        "b046": "纤月·条案",
        "a010": "桑扈·案",

    },
    "书房": {
        "b011": "无尘画案（2.18米二抽",  # 有金属
        "b012": "无尘画案（2.38米二抽",  # 有金属
        "b013": "无尘画案（1.78米四抽",  # 有金属
        "b014": "无尘画案（1.98米四抽",
        "b010": "无尘书柜",  # 有金属
        "b015": "逸兴办公桌（2.18米二抽",  # 有金属
        "b016": "逸兴办公桌（2.38米二抽",  # 有金属
        "b017": "逸兴办公桌（1.78米四抽",  # 有金属
        "b018": "逸兴办公桌（1.98米四抽",
        "a025": "明式圆角画案",  # 有金属
        "a026": "明式书架",  # 有金属
        "b019": "秦韵大办台(3.4米",
        "b020": "秦韵大办台(3.2米",
        "a027": "桑扈柜",  # 材质球命名 #有金属
        "a005": "桑扈·椅",
        "s01": "桑扈·桌",

    },
    "餐厅": {
        "a037": "明式圆台1.48米",
        "a038": "明式圆台1.38米",
        "a024": "明式圆台（1.76米",
        "b008": "明式餐桌1.55米",
        "b009": "清式餐桌1.55米",
        "a020": "明式餐椅",
        "a021": "简明式餐椅",
        "a022": "清式餐椅",
    }
}

tz = {
  "a035": "椅凳",
  "a036": "椅凳",
  "a004": "椅凳",
  "a001": "椅凳",
  "a002": "椅凳",
  "a032": "椅凳",
  "b032": "椅凳",
  "b034": "椅凳",
  "b033": "椅凳",
  "s03": "椅凳",
  "a034": "椅凳",
  "c002": "茶室",
  "c003": "茶室",
  "c004": "茶室",
  "c005": "茶室",
  "b022": "茶室",
  "b023": "茶室",
  "b024": "茶室",
  "a029": "茶室",
  "a030": "茶室",
  "b021": "茶室",
  "s02": "茶室",
  "b031": "茶室",
  "a028": "茶室",
  "b025": "茶室",
  "b026": "茶室",
  "b027": "茶室",
  "b029": "茶室",
  "a031": "茶室",
  "b030": "茶室",
  "b028": "茶室",
  "b006": "客厅",
  "b007": "客厅",
  "a013": "客厅",
  "a014": "客厅",
  "a015": "客厅",
  "a019": "客厅",
  "a016": "客厅",
  "a017": "客厅",
  "a018": "客厅",
  "a011": "客厅",
  "a012": "客厅",
  "a007": "客厅",
  "a008": "客厅",
  "a009": "客厅",
  "b001": "客厅",
  "b002": "客厅",
  "b003": "客厅",
  "a003": "客厅",
  "a006": "客厅",
  "b041": "客厅",
  "b042": "客厅",
  "b051": "柜架",
  "b052": "柜架",
  "b053": "柜架",
  "b035": "柜架",
  "b036": "柜架",
  "b037": "柜架",
  "b038": "柜架",
  "b048": "柜架",
  "b049": "柜架",
  "b050": "柜架",
  "b039": "柜架",
  "b040": "柜架",
  "b043": "柜架",
  "b044": "柜架",
  "a023": "柜架",
  "B045": "条案",
  "b046": "条案",
  "a010": "条案",
  "b011": "书房",
  "b012": "书房",
  "b013": "书房",
  "b014": "书房",
  "b010": "书房",
  "b015": "书房",
  "b016": "书房",
  "b017": "书房",
  "b018": "书房",
  "a025": "书房",
  "a026": "书房",
  "b019": "书房",
  "b020": "书房",
  "a027": "书房",
  "a005": "书房",
  "s01": "书房",
  "a037": "餐厅",
  "a038": "餐厅",
  "a024": "餐厅",
  "b008": "餐厅",
  "b009": "餐厅",
  "a020": "餐厅",
  "a021": "餐厅",
  "a022": "餐厅"
}

# import shutil
# if __name__ == '__main__':
#
#
#     path = r'F:\Share\HHH\ARKit15 - 副本\AssetBundles'
#     target_path = r'F:\Share\2018\rdx'
#
#     for i in os.listdir(path):
#         if i.startswith('ms'):
#             shutil.copy(os.path.join(path,i),os.path.join(target_path,i[1:4]))
#         elif i.startswith('s'):
#             shutil.copy(os.path.join(path,i),os.path.join(target_path,i[0:3]))
#
